---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExtrusionRoof
source: html/577926ed-6343-b457-dbb9-52bb44dc7fdb.htm
---
# ExtrusionRoof Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.